garyPenhook/PIC-Assembler/Microchip.PIC18F-Q_DFP.1.28.451.atpack_FILES/edc/PIC18F14Q40.PIC
        <edc:SFRDef edc:access="nnnn-nn-" edc:cname="SPI2INTE" edc:desc="" edc:impl="0xf6" edc:isindirect="false" edc:isvolatile="true" edc:mclr="0000-00-" edc:name="SPI2INTE" edc:nzwidth="8" edc:por="0000-00-" edc:_modsrc="DOS-02941_spi_8bit_v1.Module" edc:_refcount="2" edc:_begin="0x0" edc:_end="0xd" edc:_addr="0x98">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:AdjustPoint edc:offset="0x1"/>
              <edc:SFRFieldDef edc:cname="TXUIE" edc:mask="0x1" edc:name="TXUIE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RXOIE" edc:mask="0x1" edc:name="RXOIE" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="0x1"/>
              <edc:SFRFieldDef edc:cname="EOSIE" edc:mask="0x1" edc:name="EOSIE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SOSIE" edc:mask="0x1" edc:name="SOSIE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TCZIE" edc:mask="0x1" edc:name="TCZIE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SRMTIE" edc:mask="0x1" edc:name="SRMTIE" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:AdjustPoint edc:offset="0x1"/>
              <edc:SFRFieldDef edc:cname="SPI2TXUIE" edc:mask="0x1" edc:name="SPI2TXUIE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SPI2RXOIE" edc:mask="0x1" edc:name="SPI2RXOIE" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="0x1"/>
              <edc:SFRFieldDef edc:cname="SPI2EOSIE" edc:mask="0x1" edc:name="SPI2EOSIE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SPI2SOSIE" edc:mask="0x1" edc:name="SPI2SOSIE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SPI2TCZIE" edc:mask="0x1" edc:name="SPI2TCZIE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SPI2SRMTIE" edc:mask="0x1" edc:name="SPI2SRMTIE" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="----nnnn" edc:cname="SPI2CLK" edc:desc="" edc:impl="0xf" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----0000" edc:name="SPI2CLK" edc:nzwidth="8" edc:por="----0000" edc:_modsrc="DOS-02941_spi_8bit_v1.Module" edc:_refcount="2" edc:_begin="0x0" edc:_end="0xd" edc:_addr="0x99">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="CLKSEL" edc:mask="0xf" edc:name="CLKSEL" edc:nzwidth="8"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="CLKSEL0" edc:mask="0x1" edc:name="CLKSEL0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CLKSEL1" edc:mask="0x1" edc:name="CLKSEL1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CLKSEL2" edc:mask="0x1" edc:name="CLKSEL2" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CLKSEL3" edc:mask="0x1" edc:name="CLKSEL3" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.1">
              <edc:SFRFieldDef edc:cname="SPI2CLKSEL" edc:mask="0xf" edc:name="SPI2CLKSEL" edc:nzwidth="8"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.2">
              <edc:SFRFieldDef edc:cname="SPI2CLKSEL0" edc:mask="0x1" edc:name="SPI2CLKSEL0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SPI2CLKSEL1" edc:mask="0x1" edc:name="SPI2CLKSEL1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SPI2CLKSEL2" edc:mask="0x1" edc:name="SPI2CLKSEL2" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SPI2CLKSEL3" edc:mask="0x1" edc:name="SPI2CLKSEL3" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:AdjustPoint edc:offset="0x6" edc:_addr="0x9A"/>
        <edc:JoinedSFRDef edc:cname="DAC2DAT" edc:desc="" edc:name="DAC2DAT" edc:nzwidth="0x10" edc:_modsrc="DOS-04058_dac_nbit_ctrl_v6.Module" edc:_refcount="2" edc:_begin="0x0" edc:_end="0x3" edc:_addr="0xA0">
          <edc:SFRDef edc:access="nnnnnnnn" edc:cname="DAC2DATL" edc:desc="" edc:impl="0x0" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000" edc:name="DAC2DATL" edc:nzwidth="8" edc:por="00000000" edc:_modsrc="DOS-04058_dac_nbit_ctrl_v6.Module" edc:_refcount="2" edc:_begin="0x0" edc:_end="0x3" edc:_addr="0xA0">
            <edc:SFRModeList>
              <edc:SFRMode edc:id="DS.0">
                <edc:SFRFieldDef edc:cname="DAC2R" edc:mask="0xff" edc:name="DAC2R" edc:nzwidth="8"/>
              </edc:SFRMode>
              <edc:SFRMode edc:id="LT.0">
                <edc:SFRFieldDef edc:cname="DAC2R0" edc:mask="0x1" edc:name="DAC2R0" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="DAC2R1" edc:mask="0x1" edc:name="DAC2R1" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="DAC2R2" edc:mask="0x1" edc:name="DAC2R2" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="DAC2R3" edc:mask="0x1" edc:name="DAC2R3" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="DAC2R4" edc:mask="0x1" edc:name="DAC2R4" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="DAC2R5" edc:mask="0x1" edc:name="DAC2R5" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="DAC2R6" edc:mask="0x1" edc:name="DAC2R6" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="DAC2R7" edc:mask="0x1" edc:name="DAC2R7" edc:nzwidth="0x1"/>
              </edc:SFRMode>
              <edc:SFRMode edc:id="LT.1">
                <edc:SFRFieldDef edc:cname="DAC2RL" edc:mask="0xff" edc:name="DAC2RL" edc:nzwidth="8"/>
              </edc:SFRMode>
            </edc:SFRModeList>
          </edc:SFRDef>
          <edc:AdjustPoint edc:offset="1" edc:_addr="0xA1"/>
        </edc:JoinedSFRDef>
        <edc:SFRDef edc:access="n---nn-n" edc:cname="DAC2CON" edc:desc="" edc:impl="0xc" edc:isindirect="false" edc:isvolatile="true" edc:mclr="0---00-0" edc:name="DAC2CON" edc:nzwidth="8" edc:por="0---00-0" edc:_modsrc="DOS-04058_dac_nbit_ctrl_v6.Module" edc:_refcount="2" edc:_begin="0x0" edc:_end="0x3" edc:_addr="0xA2">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="NSS" edc:desc="" edc:mask="0x1" edc:name="NSS" edc:nzwidth="2"/>
              <edc:SFRFieldDef edc:cname="PSS" edc:desc="" edc:mask="0x3" edc:name="PSS" edc:nzwidth="2"/>
              <edc:AdjustPoint edc:offset="3"/>
              <edc:SFRFieldDef edc:cname="EN" edc:desc="" edc:mask="0x1" edc:name="EN" edc:nzwidth="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="DAC2NSS" edc:mask="0x1" edc:name="DAC2NSS" edc:nzwidth="2"/>
              <edc:SFRFieldDef edc:cname="DAC2PSS0" edc:mask="0x1" edc:name="DAC2PSS0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="DAC2PSS1" edc:mask="0x1" edc:name="DAC2PSS1" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="3"/>
              <edc:SFRFieldDef edc:cname="DAC2EN" edc:mask="0x1" edc:name="DAC2EN" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.1">
              <edc:SFRFieldDef edc:cname="NSS0" edc:mask="0x1" edc:name="NSS0" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="PSS0" edc:mask="0x1" edc:name="PSS0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="PSS1" edc:mask="0x1" edc:name="PSS0" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:AdjustPoint edc:offset="0x9" edc:_addr="0xA3"/>
        <edc:SFRDef edc:access="nn--r-r-" edc:cname="ACTCON" edc:desc="" edc:impl="0xca" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00--0-0-" edc:name="ACTCON" edc:nzwidth="8" edc:por="00--0-0-" edc:_addr="0xAC">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:AdjustPoint edc:offset="0x1"/>
              <edc:SFRFieldDef edc:cname="ORS" edc:mask="0x1" edc:name="ORS" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="0x1"/>
              <edc:SFRFieldDef edc:cname="LOCK" edc:mask="0x1" edc:name="LOCK" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="0x2"/>
              <edc:SFRFieldDef edc:cname="UD" edc:mask="0x1" edc:name="UD" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="EN" edc:mask="0x1" edc:name="EN" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:AdjustPoint edc:offset="0x1"/>
              <edc:SFRFieldDef edc:cname="ACTORS" edc:mask="0x1" edc:name="ACTORS" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="0x1"/>
              <edc:SFRFieldDef edc:cname="ACTLOCK" edc:mask="0x1" edc:name="ACTLOCK" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="0x2"/>
              <edc:SFRFieldDef edc:cname="ACTUD" edc:mask="0x1" edc:name="ACTUD" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="ACTEN" edc:mask="0x1" edc:name="ACTEN" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="-nnnnnnn" edc:cname="OSCCON1" edc:desc="" edc:impl="0x7f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="-000-000" edc:name="OSCCON1" edc:nzwidth="8" edc:por="-000-000" edc:_addr="0xAD">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="NDIV" edc:mask="0xf" edc:name="NDIV" edc:nzwidth="0x4"/>
              <edc:SFRFieldDef edc:cname="NOSC" edc:mask="0x7" edc:name="NOSC" edc:nzwidth="0x3"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="NDIV0" edc:mask="0x1" edc:name="NDIV0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="NDIV1" edc:mask="0x1" edc:name="NDIV0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="NDIV2" edc:mask="0x1" edc:name="NDIV0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="NDIV3" edc:mask="0x1" edc:name="NDIV0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="NOSC0" edc:mask="0x1" edc:name="NOSC0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="NOSC1" edc:mask="0x1" edc:name="NOSC0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="NOSC2" edc:mask="0x1" edc:name="NOSC0" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
