garyPenhook/PIC-Assembler/Microchip.PIC18F-Q_DFP.1.28.451.atpack_FILES/edc/PIC18F14Q40.PIC
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="U1TXB" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000" edc:name="U1TXB" edc:nzwidth="8" edc:por="00000000" edc:_modsrc="DOS-03076_uart_protocol_0_v1.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x13" edc:_addr="0x2A3">
          <edc:AliasList>
            <edc:MigrationAlias edc:cname="U1TXBL"/>
          </edc:AliasList>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="TXB" edc:desc="" edc:mask="0xff" edc:name="TXB" edc:nzwidth="8"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="U1TXCHK" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000" edc:name="U1TXCHK" edc:nzwidth="8" edc:por="00000000" edc:_modsrc="DOS-03076_uart_protocol_0_v1.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x13" edc:_addr="0x2A4">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="TXCHK" edc:desc="" edc:mask="0xff" edc:name="TXCHK" edc:nzwidth="8"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:JoinedSFRDef edc:cname="U1P1" edc:desc="" edc:name="U1P1" edc:nzwidth="0x10" edc:_modsrc="DOS-03076_uart_protocol_0_v1.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x13" edc:_addr="0x2A5">
          <edc:SFRModeList/>
          <edc:SFRDef edc:access="nnnnnnnn" edc:cname="U1P1L" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000" edc:name="U1P1L" edc:nzwidth="8" edc:por="00000000" edc:_modsrc="DOS-03076_uart_protocol_0_v1.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x13" edc:_addr="0x2A5">
            <edc:AliasList/>
            <edc:SFRModeList>
              <edc:SFRMode edc:id="DS.0">
                <edc:SFRFieldDef edc:cname="P1L" edc:desc="" edc:mask="0xff" edc:name="P1L" edc:nzwidth="8"/>
              </edc:SFRMode>
            </edc:SFRModeList>
          </edc:SFRDef>
          <edc:SFRDef edc:access="-------n" edc:cname="U1P1H" edc:desc="" edc:impl="0x1" edc:isindirect="false" edc:isvolatile="true" edc:mclr="-------0" edc:name="U1P1H" edc:nzwidth="8" edc:por="-------0" edc:_modsrc="DOS-03076_uart_protocol_0_v1.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x13" edc:_addr="0x2A6">
            <edc:AliasList/>
            <edc:SFRModeList>
              <edc:SFRMode edc:id="DS.0">
                <edc:SFRFieldDef edc:cname="P1H" edc:desc="" edc:mask="0x1" edc:name="P1H" edc:nzwidth="1"/>
              </edc:SFRMode>
            </edc:SFRModeList>
          </edc:SFRDef>
        </edc:JoinedSFRDef>
        <edc:JoinedSFRDef edc:cname="U1P2" edc:desc="" edc:name="U1P2" edc:nzwidth="0x10" edc:_modsrc="DOS-03076_uart_protocol_0_v1.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x13" edc:_addr="0x2A7">
          <edc:SFRModeList/>
          <edc:SFRDef edc:access="nnnnnnnn" edc:cname="U1P2L" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000" edc:name="U1P2L" edc:nzwidth="8" edc:por="00000000" edc:_modsrc="DOS-03076_uart_protocol_0_v1.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x13" edc:_addr="0x2A7">
            <edc:AliasList/>
            <edc:SFRModeList>
              <edc:SFRMode edc:id="DS.0">
                <edc:SFRFieldDef edc:cname="P2L" edc:desc="" edc:mask="0xff" edc:name="P2L" edc:nzwidth="8"/>
              </edc:SFRMode>
            </edc:SFRModeList>
          </edc:SFRDef>
          <edc:SFRDef edc:access="-------n" edc:cname="U1P2H" edc:desc="" edc:impl="0x1" edc:isindirect="false" edc:isvolatile="true" edc:mclr="-------0" edc:name="U1P2H" edc:nzwidth="8" edc:por="-------0" edc:_modsrc="DOS-03076_uart_protocol_0_v1.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x13" edc:_addr="0x2A8">
            <edc:AliasList/>
            <edc:SFRModeList>
              <edc:SFRMode edc:id="DS.0">
                <edc:SFRFieldDef edc:cname="P2H" edc:desc="" edc:mask="0x1" edc:name="P2H" edc:nzwidth="1"/>
              </edc:SFRMode>
            </edc:SFRModeList>
          </edc:SFRDef>
        </edc:JoinedSFRDef>
        <edc:JoinedSFRDef edc:cname="U1P3" edc:desc="" edc:name="U1P3" edc:nzwidth="0x10" edc:_modsrc="DOS-03076_uart_protocol_0_v1.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x13" edc:_addr="0x2A9">
          <edc:SFRModeList/>
          <edc:SFRDef edc:access="nnnnnnnn" edc:cname="U1P3L" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="xxxxxxxx" edc:name="U1P3L" edc:nzwidth="8" edc:por="xxxxxxxx" edc:_modsrc="DOS-03076_uart_protocol_0_v1.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x13" edc:_addr="0x2A9">
            <edc:AliasList/>
            <edc:SFRModeList>
              <edc:SFRMode edc:id="DS.0">
                <edc:SFRFieldDef edc:cname="P3L" edc:desc="" edc:mask="0xff" edc:name="P3L" edc:nzwidth="8"/>
              </edc:SFRMode>
            </edc:SFRModeList>
          </edc:SFRDef>
          <edc:SFRDef edc:access="-------n" edc:cname="U1P3H" edc:desc="" edc:impl="0x1" edc:isindirect="false" edc:isvolatile="true" edc:mclr="-------0" edc:name="U1P3H" edc:nzwidth="8" edc:por="-------0" edc:_modsrc="DOS-03076_uart_protocol_0_v1.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x13" edc:_addr="0x2AA">
            <edc:AliasList/>
            <edc:SFRModeList>
              <edc:SFRMode edc:id="DS.0">
                <edc:SFRFieldDef edc:cname="P3H" edc:desc="" edc:mask="0x1" edc:name="P3H" edc:nzwidth="1"/>
              </edc:SFRMode>
            </edc:SFRModeList>
          </edc:SFRDef>
        </edc:JoinedSFRDef>
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="U1CON0" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000" edc:name="U1CON0" edc:nzwidth="8" edc:por="00000000" edc:_modsrc="DOS-03076_uart_protocol_0_v1.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x13" edc:_addr="0x2AB">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="MODE0" edc:desc="" edc:mask="0x1" edc:name="MODE0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="MODE1" edc:desc="" edc:mask="0x1" edc:name="MODE1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="MODE2" edc:desc="" edc:mask="0x1" edc:name="MODE2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="MODE3" edc:desc="" edc:mask="0x1" edc:name="MODE3" edc:nzwidth="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.1">
              <edc:SFRFieldDef edc:cname="U1MODE" edc:desc="" edc:mask="0xf" edc:name="U1MODE" edc:nzwidth="4"/>
              <edc:SFRFieldDef edc:cname="U1RXEN" edc:desc="" edc:mask="0x1" edc:name="U1RXEN" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="U1TXEN" edc:desc="" edc:mask="0x1" edc:name="U1TXEN" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="U1ABDEN" edc:desc="" edc:mask="0x1" edc:name="U1ABDEN" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="U1BRGS" edc:desc="" edc:mask="0x1" edc:name="U1BRGS" edc:nzwidth="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.2">
              <edc:SFRFieldDef edc:cname="U1MODE0" edc:desc="" edc:mask="0x1" edc:name="U1MODE0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="U1MODE1" edc:desc="" edc:mask="0x1" edc:name="U1MODE1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="U1MODE2" edc:desc="" edc:mask="0x1" edc:name="U1MODE2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="U1MODE3" edc:desc="" edc:mask="0x1" edc:name="U1MODE3" edc:nzwidth="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="MODE" edc:desc="" edc:mask="0xf" edc:name="MODE" edc:nzwidth="4"/>
              <edc:SFRFieldDef edc:cname="RXEN" edc:desc="" edc:mask="0x1" edc:name="RXEN" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="TXEN" edc:desc="" edc:mask="0x1" edc:name="TXEN" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="ABDEN" edc:desc="" edc:mask="0x1" edc:name="ABDEN" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="BRGS" edc:desc="" edc:mask="0x1" edc:name="BRGS" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="n--nn-nn" edc:cname="U1CON1" edc:desc="" edc:impl="0x9b" edc:isindirect="false" edc:isvolatile="true" edc:mclr="0--00-00" edc:name="U1CON1" edc:nzwidth="8" edc:por="0--00-00" edc:_modsrc="DOS-03076_uart_protocol_0_v1.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x13" edc:_addr="0x2AC">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="SENDB" edc:desc="" edc:mask="0x1" edc:name="SENDB" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="BRKOVR" edc:desc="" edc:mask="0x1" edc:name="BRKOVR" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="RXBIMD" edc:desc="" edc:mask="0x1" edc:name="RXBIMD" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="WUE" edc:desc="" edc:mask="0x1" edc:name="WUE" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="2"/>
              <edc:SFRFieldDef edc:cname="ON" edc:desc="" edc:mask="0x1" edc:name="ON" edc:nzwidth="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="U1SENDB" edc:desc="" edc:mask="0x1" edc:name="U1SENDB" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="U1BRKOVR" edc:desc="" edc:mask="0x1" edc:name="U1BRKOVR" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="U1RXBIMD" edc:desc="" edc:mask="0x1" edc:name="U1RXBIMD" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="U1WUE" edc:desc="" edc:mask="0x1" edc:name="U1WUE" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="2"/>
              <edc:SFRFieldDef edc:cname="U1ON" edc:desc="" edc:mask="0x1" edc:name="U1ON" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="U1CON2" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000" edc:name="U1CON2" edc:nzwidth="8" edc:por="00000000" edc:_modsrc="DOS-03076_uart_protocol_0_v1.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x13" edc:_addr="0x2AD">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="FLO" edc:desc="" edc:mask="0x3" edc:name="FLO" edc:nzwidth="2"/>
              <edc:SFRFieldDef edc:cname="TXPOL" edc:desc="" edc:mask="0x1" edc:name="TXPOL" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="C0EN" edc:desc="" edc:mask="0x1" edc:name="C0EN" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="STP" edc:desc="" edc:mask="0x3" edc:name="STP" edc:nzwidth="2"/>
              <edc:SFRFieldDef edc:cname="RXPOL" edc:desc="" edc:mask="0x1" edc:name="RXPOL" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RUNOVF" edc:desc="" edc:mask="0x1" edc:name="RUNOVF" edc:nzwidth="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="FLO0" edc:desc="" edc:mask="0x1" edc:name="FLO0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="FLO1" edc:desc="" edc:mask="0x1" edc:name="FLO1" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="2"/>
              <edc:SFRFieldDef edc:cname="STP0" edc:desc="" edc:mask="0x1" edc:name="STP0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="STP1" edc:desc="" edc:mask="0x1" edc:name="STP1" edc:nzwidth="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.1">
              <edc:SFRFieldDef edc:cname="U1FLO" edc:desc="" edc:mask="0x3" edc:name="U1FLO" edc:nzwidth="2"/>
              <edc:SFRFieldDef edc:cname="U1TXPOL" edc:desc="" edc:mask="0x1" edc:name="U1TXPOL" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="U1C0EN" edc:desc="" edc:mask="0x1" edc:name="U1C0EN" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="U1STP" edc:desc="" edc:mask="0x3" edc:name="U1STP" edc:nzwidth="2"/>
              <edc:SFRFieldDef edc:cname="U1RXPOL" edc:desc="" edc:mask="0x1" edc:name="U1RXPOL" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="U1RUNOVF" edc:desc="" edc:mask="0x1" edc:name="U1RUNOVF" edc:nzwidth="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.2">
              <edc:SFRFieldDef edc:cname="U1FLO0" edc:desc="" edc:mask="0x1" edc:name="U1FLO0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="U1FLO1" edc:desc="" edc:mask="0x1" edc:name="U1FLO1" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="2"/>
              <edc:SFRFieldDef edc:cname="U1STP0" edc:desc="" edc:mask="0x1" edc:name="U1STP0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="U1STP1" edc:desc="" edc:mask="0x1" edc:name="U1STP1" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:JoinedSFRDef edc:cname="U1BRG" edc:desc="" edc:name="U1BRG" edc:nzwidth="0x10" edc:_modsrc="DOS-03076_uart_protocol_0_v1.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x13" edc:_addr="0x2AE">
          <edc:SFRModeList/>
          <edc:SFRDef edc:access="nnnnnnnn" edc:cname="U1BRGL" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000" edc:name="U1BRGL" edc:nzwidth="8" edc:por="00000000" edc:_modsrc="DOS-03076_uart_protocol_0_v1.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x13" edc:_addr="0x2AE">
            <edc:AliasList/>
            <edc:SFRModeList>
              <edc:SFRMode edc:id="DS.0">
                <edc:SFRFieldDef edc:cname="BRGL" edc:desc="" edc:mask="0xff" edc:name="BRGL" edc:nzwidth="8"/>
              </edc:SFRMode>
            </edc:SFRModeList>
          </edc:SFRDef>
          <edc:SFRDef edc:access="nnnnnnnn" edc:cname="U1BRGH" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000" edc:name="U1BRGH" edc:nzwidth="8" edc:por="00000000" edc:_modsrc="DOS-03076_uart_protocol_0_v1.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x13" edc:_addr="0x2AF">
            <edc:AliasList/>
            <edc:SFRModeList>
              <edc:SFRMode edc:id="DS.0">
                <edc:SFRFieldDef edc:cname="BRGH" edc:desc="" edc:mask="0xff" edc:name="BRGH" edc:nzwidth="8"/>
              </edc:SFRMode>
            </edc:SFRModeList>
          </edc:SFRDef>
        </edc:JoinedSFRDef>
        <edc:SFRDef edc:access="nnnrrrrr" edc:cname="U1FIFO" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00101110" edc:name="U1FIFO" edc:nzwidth="8" edc:por="00101110" edc:_modsrc="DOS-03076_uart_protocol_0_v1.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x13" edc:_addr="0x2B0">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="RXBF" edc:desc="" edc:mask="0x1" edc:name="RXBF" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RXBE" edc:desc="" edc:mask="0x1" edc:name="RXBE" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="XON" edc:desc="" edc:mask="0x1" edc:name="XON" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RXIDL" edc:desc="" edc:mask="0x1" edc:name="RXIDL" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="TXBF" edc:desc="" edc:mask="0x1" edc:name="TXBF" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="TXBE" edc:desc="" edc:mask="0x1" edc:name="TXBE" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="STPMD" edc:desc="" edc:mask="0x1" edc:name="STPMD" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="TXWRE" edc:desc="" edc:mask="0x1" edc:name="TXWRE" edc:nzwidth="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="U1RXBF" edc:desc="" edc:mask="0x1" edc:name="U1RXBF" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="U1RXBE" edc:desc="" edc:mask="0x1" edc:name="U1RXBE" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="U1XON" edc:desc="" edc:mask="0x1" edc:name="U1XON" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="U1RXIDL" edc:desc="" edc:mask="0x1" edc:name="U1RXIDL" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="U1TXBF" edc:desc="" edc:mask="0x1" edc:name="U1TXBF" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="U1TXBE" edc:desc="" edc:mask="0x1" edc:name="U1TXBE" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="U1STPMD" edc:desc="" edc:mask="0x1" edc:name="U1STPMD" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="U1TXWRE" edc:desc="" edc:mask="0x1" edc:name="U1TXWRE" edc:nzwidth="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.1">
              <edc:AdjustPoint edc:offset="0x3"/>
              <edc:SFRFieldDef edc:cname="U1RCIDL" edc:mask="0x1" edc:name="U1RCIDL" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.2">
              <edc:AdjustPoint edc:offset="0x3"/>
              <edc:SFRFieldDef edc:cname="RCIDL" edc:mask="0x1" edc:name="RCIDL" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
