garyPenhook/PIC-Assembler/Microchip.PIC18F-Q_DFP.1.28.451.atpack_FILES/edc/PIC18F14Q40.PIC
        <edc:SFRDef edc:access="rnn-rrrr" edc:cname="PIR7" edc:desc="" edc:impl="0xef" edc:isindirect="false" edc:isvolatile="true" edc:mclr="000-0000" edc:name="PIR7" edc:nzwidth="8" edc:por="000-0000" edc:_modsrc="DOS-xxxx_Interrupts_Q41_8bit.Module" edc:_refcount="3" edc:_begin="0x0" edc:_end="0xb" edc:_addr="0x4BA">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="I2C1RXIF" edc:mask="0x1" edc:name="I2C1RXIF" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="I2C1TXIF" edc:mask="0x1" edc:name="I2C1TXIF" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="I2C1IF" edc:mask="0x1" edc:name="I2C1IF" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="I2C1EIF" edc:mask="0x1" edc:name="I2C1EIF" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="CLC3IF" edc:mask="0x1" edc:name="CLC3IF" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="PWM3PIF" edc:mask="0x1" edc:name="PWM3PIF" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="PWM3IF" edc:mask="0x1" edc:name="PWM3IF" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="n-n-nnnn" edc:cname="PIR8" edc:desc="" edc:impl="0xaf" edc:isindirect="false" edc:isvolatile="true" edc:mclr="0-0-0000" edc:name="PIR8" edc:nzwidth="8" edc:por="0-0-0000" edc:_modsrc="DOS-xxxx_Interrupts_Q41_8bit.Module" edc:_refcount="3" edc:_begin="0x0" edc:_end="0xb" edc:_addr="0x4BB">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="U2RXIF" edc:mask="0x1" edc:name="U2RXIF" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="U2TXIF" edc:mask="0x1" edc:name="U2TXIF" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="U2EIF" edc:mask="0x1" edc:name="U2EIF" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="U2IF" edc:mask="0x1" edc:name="U2IF" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="CLC4IF" edc:mask="0x1" edc:name="CLC4IF" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="SCANIF" edc:mask="0x1" edc:name="SCANIF" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="PIR9" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000" edc:name="PIR9" edc:nzwidth="8" edc:por="00000000" edc:_modsrc="DOS-xxxx_Interrupts_Q41_8bit.Module" edc:_refcount="3" edc:_begin="0x0" edc:_end="0xb" edc:_addr="0x4BC">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="U3RXIF" edc:mask="0x1" edc:name="U3RXIF" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="U3TXIF" edc:mask="0x1" edc:name="U3TXIF" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="U3EIF" edc:mask="0x1" edc:name="U3EIF" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="U3IF" edc:mask="0x1" edc:name="U3IF" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="DMA3SCNTIF" edc:mask="0x1" edc:name="DMA3SCNTIF" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="DMA3DCNTIF" edc:mask="0x1" edc:name="DMA3DCNTIF" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="DMA3ORIF" edc:mask="0x1" edc:name="DMA3ORIF" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="DMA3AIF" edc:mask="0x1" edc:name="DMA3AIF" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnn--n" edc:cname="PIR10" edc:desc="" edc:impl="0xf9" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000--0" edc:name="PIR10" edc:nzwidth="8" edc:por="00000--0" edc:_modsrc="DOS-xxxx_Interrupts_Q41_8bit.Module" edc:_refcount="3" edc:_begin="0x0" edc:_end="0xb" edc:_addr="0x4BD">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="INT2IF" edc:mask="0x1" edc:name="INT2IF" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="0x2"/>
              <edc:SFRFieldDef edc:cname="TMR4IF" edc:mask="0x1" edc:name="TMR4IF" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="DMA4SCNTIF" edc:mask="0x1" edc:name="DMA4SCNTIF" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="DMA4DCNTIF" edc:mask="0x1" edc:name="DMA4DCNTIF" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="DMA4ORIF" edc:mask="0x1" edc:name="DMA4ORIF" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="DMA4AIF" edc:mask="0x1" edc:name="DMA4AIF" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="--nn-nnn" edc:cname="LATA" edc:desc="" edc:impl="0x37" edc:isindirect="false" edc:isvolatile="true" edc:mclr="--uu-uuu" edc:name="LATA" edc:nzwidth="0x8" edc:por="--xx-xxx" edc:_addr="0x4BE">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="LATA0" edc:desc="" edc:mask="0x1" edc:name="LATA0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="LATA1" edc:desc="" edc:mask="0x1" edc:name="LATA1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="LATA2" edc:desc="" edc:mask="0x1" edc:name="LATA2" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="LATA4" edc:desc="" edc:mask="0x1" edc:name="LATA4" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="LATA5" edc:desc="" edc:mask="0x1" edc:name="LATA5" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="" edc:stimregfiles="w" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnn----" edc:cname="LATB" edc:desc="" edc:impl="0xf0" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uuuu----" edc:name="LATB" edc:nzwidth="0x8" edc:por="xxxx----" edc:_addr="0x4BF">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:AdjustPoint edc:offset="4"/>
              <edc:SFRFieldDef edc:cname="LATB4" edc:desc="" edc:mask="0x1" edc:name="LATB4" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="LATB5" edc:desc="" edc:mask="0x1" edc:name="LATB5" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="LATB6" edc:desc="" edc:mask="0x1" edc:name="LATB6" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="LATB7" edc:desc="" edc:mask="0x1" edc:name="LATB7" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="" edc:stimregfiles="w" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
